Задача:
Считая, что кубический фут равен 7.481 галлона, написать программу, запрашивающую у пользователя число галлонов и выводящую на экран эквивалентный объем в кубических футах.

Решение:
 - 1. В методе Main с помощью метода Console.WriteLine() просим пользователя ввести  какое-то значение в галлонах;
 - 2. Помещаем значение введенное пользователем в переменную gallon типа double. C помощью метода Console.ReadLine и Parse считываем строку и конвертируем значение в тип double соответственно ;
 - 3. Создаем метод с именем ConvertGallonToCubikFoot и передаем в него параметры введенные пользователем;
 - 4. Создаем константу с именем cubikFoot типа double и присваиваем ей значение - 7.481; 

 - 5. Создаем переменную result типа double и присваиваем ей значение введенное пользователем, которое делим на нашу константу;
 - 6. В методе Main создаем переменную result типа double и присваиваем значение возвращаемое методом ConvertGallonToCubikFoot.
 - 7. Выводим результат на экран с помощью метода Console.WriteLine();
 - 8. Написать тесты.