Задача:
Две дроби а/b и c/d можно сложить следующим образом:
a/b + c/d = (a*d + b*c)/(b*d)
Например, 1/4 + 2/3 = (1*3 + 4*2)/4*3 = 11/12
Напишите программу, запрашивающую у пользователя значения двух дробей, а затем выводящую результат, также записанный в форме дроби.
Взаимодействие программы с пользователем может выглядеть, например, следующим образом:
Введите первую дробь: 1/2
Введите вторую дробь: 2/5
Сумма равна 9/10

Решение:
- 1. Пишем тесты к задаче.
- 2. В классе Program в методе Main() с помощью Console.WriteLine() выводим сообщение о необходимости указать две дроби.
- 3. Создаем две переменные и принимаем в них значение введенное пользователем.
- 4. Создаем интерфейс IFraction c одним методом double ArithmeticFraction(double firstFraction, double secondFraction )
- 5. Создаем класс Fraction и в нем метод ArithmeticFraction(double firstFraction, double secondFraction), который принимаем два аргумента от пользователя и внутри слаживает их между собой. Реализуем интерфейс
- 6. В классе Program в методе Main() создаем экземпляр класса Fraction. На экземпляре вызываем наш метод ArithmeticFraction(double firstFraction, double secondFraction) и передаем в метод аргументы введенные пользователем.
- 7. Присваиваем возвращаемое значение метода переменной и выводим результат на экран.

