Напишите программу, выводящую следующую таблицу:

1990      135
1991     7290    
1992    11300 
1993    16200

Решение:
 + 1. Создаем класс Table, в теле которого создаем приватное поле типа массива.
 + 2. В теле класса создаем пользовательский конструктор с параметрами и передаем значения.
 + 3. В теле класса создаем метод, который ничего не принимает и ничего не возвращает и в теле метода с помощью метода Console.WriteLine() выводим наши значения используя перенос строки и табуляцию - \n, \t
 + 4. В Program в теле класса Main создаем экземпляр нашего класса и на экземпляре вызываем метод PrintOnScreen();
 + 5. Создаем тест.